[
  {
    "id": 1,
    "title": "GYG - Admin Panel for Restaurant Management (Resto 365)",
    "logo": "/img/gyg/resto-365.jpg",
    "description": "The Guzman y Gomez Admin Panel is a robust web application designed to streamline restaurant management operations. This intuitive interface allows administrators to efficiently manage restaurant profiles, menus, and service options, ensuring a seamless experience for both staff and customers.",
    "companyName": "Guzman Y Gomez",
    "companySite": "https://www.guzmanygomez.com/",
    "workLogo": "/img/gyg/gyg.png",
    "role": "Senior Software Engineer",
    "data": [
      {
        "heading": "Restaurant Management",
        "bullets": [
          "Add and edit restaurant profiles, including details like location, operating hours, and contact information.",
          "Manage multiple restaurant locations under one account for centralized oversight."
        ]
      },
      {
        "heading": "Menu Management",
        "bullets": [
          "Create and modify menus for breakfast, lunch, and dinner.",
          "Add individual items with detailed descriptions, pricing, and dietary information to enhance customer engagement.",
          "Categorize menu items into specific sections, such as appetizers, mains, and desserts, for easy navigation."
        ]
      },
      {
        "heading": "Service Management",
        "bullets": [
          "Enable or disable various service options such as delivery, pickup, and table service to adapt to operational needs.",
          "Manage service availability based on restaurant hours or special events."
        ]
      },
      {
        "heading": "Equipment Management",
        "bullets": [
          "Keep track of essential kitchen equipment, including liquor storage, fryers, quesadilla makers, ice machines, coffee machines, soft serve machines, and gas types.",
          "Monitor the status and maintenance schedules of these machines to ensure optimal performance."
        ]
      },
      {
        "heading": "History Log Management",
        "bullets": [
          "Maintain a comprehensive history log that records changes made within the admin panel, including additions, modifications, and deletions.",
          "Access historical data to review past menu changes, service status updates, and equipment management actions for better decision-making."
        ]
      }
    ],
    "technologies": [
      "Javascript",
      "Typescript",
      "Next Js",
      "Redux",
      "React Js",
      "Jest test cases",
      "Mysql",
      "Node Js",
      "Express Js",
      "Material UI",
      "Type ORM",
      "CI/CD",
      "AWS SM",
      "AWS PS"
    ],
    "images": [
      {
        "src": "/img/gyg/Resto_list.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg/resto_profile.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg/user_list.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg/history_log.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg/menu_management.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg/equipment.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg/trading_hours.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg/customer_support.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg/img1.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg/img2.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg/img3.png",
        "alt": "Description of image 3"
      }
    ],
    "link": "https://resto365.prod.ops.gyg.com.au/"
  },
  {
    "id": 2,
    "title": "GYG - Online Ordering System",
    "logo": "/img/gyg-order/logo.png",
    "description": "The Guzman y Gomez online ordering system is a robust and scalable web application designed to provide a seamless and user-friendly experience for customers. Built with cutting-edge technologies, it efficiently handles high-traffic demand and complex menu structures while ensuring smooth and secure order processing.",
    "companyName": "Guzman Y Gomez",
    "companySite": "https://order.guzmanygomez.com.au/",
    "workLogo": "/img/gyg-order/logo.png",
    "role": "Senior Software Engineer",
    "data": [
      {
        "heading": "Frontend",
        "bullets": [
          "Developed using React and enhanced with custom components to deliver a dynamic and highly interactive user interface.",
          "Integrated Braze for advanced customer engagement and personalized experiences.",
          "Ensured responsiveness and cross-browser compatibility, creating an intuitive, visually appealing interface for users across devices."
        ]
      },
      {
        "heading": "Backend",
        "bullets": [
          "Powered by AWS Lambda functions, leveraging the scalability and cost-efficiency of serverless architecture.",
          "Utilized AWS Step Functions to orchestrate complex workflows, ensuring seamless order processing and management.",
          "Secured sensitive data with AWS Secrets Manager and handled configuration management with AWS Parameter Store.",
          "Implemented AWS RDS for relational database needs, ensuring high availability and strong data consistency.",
          "Integrated with Redis for caching and optimizing performance by reducing the load on primary databases."
        ]
      }
    ],
    "technologies": [
      "Javascript",
      "Typescript",
      "Redux",
      "React Js",
      "Jest test cases",
      "Mysql",
      "Node Js",
      "Custom Ui",
      "AWS Lambda",
      "AWS StepFunction",
      "AWS Cloudmonitor",
      "AWA SP",
      "AWS RDS",
      "AWS PS",
      "AWS DynamoDB",
      "Sequelize ORM",
      "Private npm packages",
      "CI/CD",
      "Redis"
    ],
    "images": [
      {
        "src": "/img/gyg-order/img0.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg-order/img1.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg-order/img2.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg-order/img3.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg-order/all.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg-order/img11.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg-order/img12.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg-order/img13.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg-order/img14.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg-order/img15.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg-order/img16.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gyg-order/img17.png",
        "alt": "Description of image 3"
      }
    ],
    "link": "https://order.guzmanygomez.com.au/"
  },
  {
    "id": 3,
    "title": "GYG - Third-party delivery partners integration",
    "logo": "/img/gyg-order/logo.png",
    "description": "The integration system efficiently connects Guzman y Gomez’s internal infrastructure with third-party delivery partners to streamline order management and maintain real-time data synchronization with the restaurant’s POS system. The architecture is built to handle multiple external delivery platforms, such as UberEats, DoorDash, and Menulog, ensuring that orders are ingested, validated, and processed accurately.",
    "companyName": "Guzman Y Gomez",
    "companySite": "https://order.guzmanygomez.com.au/",
    "workLogo": "/img/gyg-order/logo.png",
    "role": "Senior Software Engineer",
    "data": [
      {
        "heading": "Order Ingestion via Node.js API",
        "bullets": [
          "The system begins by fetching orders from various delivery partners using a Node.js API.",
          "Node.js handles communication with third-party APIs, parsing incoming data, and normalizing order details to match a consistent schema.",
          "The Node API is designed to be highly resilient, employing retries, rate-limiting, and error handling to ensure orders are reliably ingested even under adverse network conditions."
        ]
      },
      {
        "heading": "Order Processing and Validation with .NET Service:",
        "bullets": [
          "Once the orders are received and standardized, the data is handed off to a .NET Service, which performs in-depth order processing and validation.",
          "This service includes business logic for menu item mapping, price validation, discount handling, and other rules that need to be enforced before the orders are committed to the POS system.",
          "The .NET service also ensures that each order adheres to internal requirements, such as menu availability and order timing constraints, providing a robust mechanism to flag and handle any discrepancies."
        ]
      },
      {
        "heading": "Database and Data Management:",
        "bullets": [
          "Validated order data is then stored using MySQL, leveraging ORM types for strong typing and simplified data access patterns.",
          "The MySQL database acts as a centralized store for managing incoming orders, tracking order history, and maintaining logs for auditing and troubleshooting."
        ]
      },
      {
        "heading": "Internal System Integration:",
        "bullets": [
          "After processing and validation, the orders are inserted into the TASK POS system using the appropriate API endpoints.",
          "This ensures that all validated orders are synchronized in real-time with the POS system, enabling restaurant staff to view, manage, and fulfill orders efficiently."
        ]
      },
      {
        "heading": "Monitoring and Logging:",
        "bullets": [
          "The system includes comprehensive monitoring using CloudWatch and custom logging mechanisms to track order states, API calls, and processing errors.",
          "Alerts are configured to notify the support team of any anomalies, ensuring swift resolution of any issues that may arise."
        ]
      }
    ],
    "technologies": [
      "Javascript",
      "Typescript",
      "React Js",
      "C# services",
      "Mysql",
      "Sequelize ORM",
      "Node Js",
      "Express Js",
      "Jest test Cases",
      "Material UI"
    ],
    "images": [
      {
        "src": "/img/delivery-partner/D1.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/delivery-partner/D2.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/delivery-partner/D3.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/delivery-partner/D4.png",
        "alt": "Description of image 4"
      },
      {
        "src": "/img/delivery-partner/D5.png",
        "alt": "Description of image 5"
      },
      {
        "src": "/img/delivery-partner/D6.png",
        "alt": "Description of image 6"
      }
    ],
    "link": "https://neemiya.com/"
  },
  {
    "id": 4,
    "title": "CREAT: Restaurant Reservation",
    "logo": "/img/creat/customer/CE_Logo.png",
    "description": "Our restaurant reservation app offers a seamless and user-friendly experience, allowing diners to easily book tables for breakfast, lunch, or dinner. With a few taps, users can discover and reserve their favorite restaurants, making dining out a breeze.",
    "companyName": "Freelance",
    "companySite": "https://creat.sg/",
    "workLogo": "/img/capauth/freelance.png",
    "role": "Project Manager & Senior Software Engineer",
    "data": [
      {
        "heading": "Customer Side",
        "bullets": [
          "Intuitive Booking Process: Users can easily select their preferred date, time, and party size for their reservation.",
          "Meal-Specific Options: The app caters to different dining experiences by offering separate booking options for breakfast, lunch, and dinner.",
          "Real-Time Availability: Users can view up-to-date table availability, ensuring they can make informed decisions about their reservations.",
          "Special Requests: A feature allowing users to note any special requirements or preferences when making a reservation.",
          "Confirmation System: Automatic confirmation emails or SMS messages are sent to users upon successful booking."
        ]
      },
      {
        "heading": "Admin Side",
        "bullets": [
          "Reservation Dashboard: A comprehensive view of all current and upcoming reservations, sortable by date, time, and party size.",
          "Table Management: Ability to assign and reassign tables based on party size and restaurant layout.",
          "Customer Database: A database storing customer information, reservation history, and preferences for personalized service.",
          "Customizable Settings: Options to set restaurant capacity, opening hours, and special event dates.",
          "Reporting Tools: Analytics and reporting tools to track reservation trends, peak hours, and revenue generated.",
          "Staff Management: Assign roles and permissions to different staff members for using the admin interface."
        ]
      }
    ],
    "technologies": [
      "Javascript",
      "Typescript",
      "React Js",
      "Redux",
      "Postgress",
      "Sequelize ORM",
      "Node Js",
      "Express Js",
      "Jest test Cases",
      "Material UI",
      "IVRS integration",
      "Strapi Payment",
      "Union Pay",
      "CI/CD"
    ],
    "images": [
      {
        "src": "/img/creat/admin/CA1.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/creat/admin/CA2.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/creat/admin/CA3.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/creat/admin/CA4.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/creat/admin/CA5.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/creat/admin/CA6.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/creat/admin/CA7.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/creat/admin/CA8.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/creat/admin/CA9.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/creat/admin/CA10.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/creat/customer/CC1.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/creat/customer/CC2.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/creat/customer/CCP3.png",
        "alt": "Description of image 3"
      }
    ],
    "link": "https://creat.sg/"
  },
  {
    "id": 5,
    "title": "Capauth: Django SSO Backend",
    "logo": "/img/capauth/capabara.png",
    "description": "Capabara is a comprehensive organisation and user management system designed to facilitate efficient handling of multi-organisational structures, user access controls, and subscription management. The system provides a robust framework for creating, managing, and navigating complex organisational hierarchies while maintaining granular control over user permissions and access.",
    "companyName": "Freelance",
    "companySite": "https://capauth-staging.theadventus.com/",
    "workLogo": "/img/capauth/freelance.png",
    "role": "Project Manager & Senior Software Engineer",
    "data": [
      {
        "heading": "Organisation Management",
        "bullets": [
          "All users can view all organisations, with potential for future modifications to restrict visibility.",
          "Users can create new organisations, automatically becoming admins of the organisations they create.",
          "New users are initially assigned to a default organisation before creating or joining others.",
          "Only the creator of an organisation can edit or delete it."
        ]
      },
      {
        "heading": "User Management",
        "bullets": [
          "Users within an organisation can access information about other users in the same organisation.",
          "Check if the new user belongs to the same company, verify if the user already exists, and manage organisation assignments.",
          "Users need to register in Cap-ai and other integrated systems.",
          "Only admins or the user themselves can edit or delete user information."
        ]
      }
    ],
    "technologies": [
      "Javascript",
      "Typescript",
      "React Js",
      "Redux",
      "Postgress",
      "Material UI",
      "Python",
      "Django"
    ],
    "images": [],
    "link": "https://capauth-staging.theadventus.com/"
  },
  {
    "id": 6,
    "title": "Lucky Minute : The One Minute Gaming App",
    "logo": "/img/lucky-minute/Logo.svg",
    "description": "Join Lucky Minute, the exhilarating online gaming platform where you can dive into thrilling rounds of Baccarat, Roulette, and Sic Bo! After a quick verification, you'll be randomly placed in groups to enjoy fast-paced, one-minute gameplay. Discover if you’ve won or lost in just a minute!",
    "companyName": "Freelance",
    "companySite": "https://lucky-minute.com/",
    "workLogo": "/img/capauth/freelance.png",
    "role": "Senior Software Engineer",
    "data": [
      {
        "heading": "Frontend",
        "bullets": [
          "One-Minute Rounds: Experience the thrill with fast gameplay.",
          "Instant Results: See if you’ve won or lost right after each round",
          "Random Group Play: Join different players for a fresh experience each time.",
          "Simple Verification: Quick and easy process to get started.",
          "User-Friendly Design: Navigate seamlessly on any device.",
          "Secure Gaming: Enjoy a safe and protected environment.",
          "Real-Time Player Interaction: Engage with others while you play.",
          "Mobile Friendly: Play anytime, anywhere on your mobile device.",
          "Exciting Rewards: Win bonuses based on your performance.",
          "Engaging Experience: Feel the rush of every game with every round!"
        ]
      }
    ],
    "technologies": [
      "Javascript",
      "Typescript",
      "React Js",
      "Redux",
      "A&T Design"
    ],
    "images": [
      {
        "src": "/img/lucky-minute/img0.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/lucky-minute/img10.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/lucky-minute/img11.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/lucky-minute/img12.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/lucky-minute/img1.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/lucky-minute/img8.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/lucky-minute/img9.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/lucky-minute/img7.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/lucky-minute/img2.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/lucky-minute/img3.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/lucky-minute/img4.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/lucky-minute/img5.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/lucky-minute/img6.png",
        "alt": "Description of image 3"
      }
    ],
    "link": "https://lucky-minute.com/"
  },
  {
    "id": 7,
    "title": "ORDRSTARTR : Facebook Live Selling System",
    "logo": "/img/live-order/logo.png",
    "description": "ORDRSTARTR is an innovative social commerce platform specifically designed to capture and process orders during Facebook Live sessions. It utilizes a powerful tech stack, including React and Redux on the frontend for a highly interactive and responsive user interface, while the backend is powered by Node.js. The system relies on PostgreSQL as the primary database, managed through Sequelize ORM to ensure efficient data handling and integrity. With this architecture, ORDRSTARTR provides a seamless, real-time shopping experience, enabling businesses to boost engagement and streamline purchases directly from live interactions.",
    "companyName": "Freelance",
    "companySite": "https://ordrstartr-frontend.vercel.app/",
    "workLogo": "/img/capauth/freelance.png",
    "role": "Project Manager & Senior Software Engineer",
    "data": [
      {
        "heading": "Order Management",
        "bullets": [
          "Edit and update orders in real-time.",
          "Manage the order status and history."
        ]
      },
      {
        "heading": "Communication",
        "bullets": [
          "Send personalized messages to customers.",
          "Send notifications and alerts to customers."
        ]
      },
      {
        "heading": "Product Management",
        "bullets": [
          "Add, edit, or remove products from the catalog.",
          "Manage product inventory and availability."
        ]
      },
      {
        "heading": "Payment and Checkout",
        "bullets": [
          "Oversee and manage the payment processing.",
          "Handle refunds, payment confirmations, and checkout issues."
        ]
      },
      {
        "heading": "User Profile Management",
        "bullets": [
          "Manage customer profiles with loyalty points and history.",
          "Implement loyalty management and coupon distribution."
        ]
      },
      {
        "heading": "Promotions and Discounts",
        "bullets": [
          "Create and apply discount codes and special offers.",
          "Track promotional campaigns and their effectiveness."
        ]
      },
      {
        "heading": "Live Stream Shopping",
        "bullets": [
          "Browse and interact with products showcased during live sessions.",
          "View product details and ask questions in real-time."
        ]
      },
      {
        "heading": "Seamless Purchase Experience",
        "bullets": [
          "Purchase products directly from live streaming.",
          "Receive instant checkout links for quick transactions."
        ]
      },
      {
        "heading": "Order Placement and Tracking",
        "bullets": [
          "Place orders during the live session without leaving the stream.",
          "Track order status and receive updates on delivery."
        ]
      },
      {
        "heading": "Secure Checkout Process",
        "bullets": [
          "Complete the checkout using secure payment gateways.",
          "Apply discounts and coupon codes during checkout."
        ]
      }
    ],
    "technologies": [
      "Javascript",
      "Typescript",
      "React Js",
      "Node Js",
      "Express Js",
      "MongoDB",
      "Mongoose",
      "Swagger",
      "Docker",
      "Jest test",
      "Material UI",
      "Strapi Payment",
      "Union Pay"
    ],
    "images": [
      {
        "src": "/img/live-order/img0.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/live-order/img1.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/live-order/img8.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/live-order/img9.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/live-order/img7.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/live-order/img2.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/live-order/img3.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/live-order/img4.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/live-order/img5.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/live-order/img6.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/live-order/Fb1.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/live-order/fb2.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/live-order/fb3.png",
        "alt": "Description of image 3"
      }
    ],
    "link": "https://ordrstartr-frontend.vercel.app/"
  },
  {
    "id": 8,
    "title": "NEEMIYA : Effective Lead Generation Platform",
    "logo": "/img/neemiya/logo.png",
    "description": "Neemiya is a platform that helps businesses create and manage landing pages to capture leads effectively. It provides tools like drag-and-drop builders, analytics, and CRM integrations, making it easier to optimize marketing campaigns and track performance. The platform is suitable for agencies and businesses aiming to enhance their lead generation and streamline client management.",
    "companyName": "Freelance",
    "companySite": "https://neemiya.com/",
    "workLogo": "/img/capauth/freelance.png",
    "role": "Senior Software Engineer",
    "data": [
      {
        "heading": "Landing Page Builder",
        "bullets": [
          "Create high-converting landing pages with a drag-and-drop interface.",
          "Customize templates to fit your brand and campaign needs."
        ]
      },
      {
        "heading": "Lead Management",
        "bullets": [
          "Track and manage leads in one place.",
          "Integrates with CRM systems like Salesforce, Pipedrive, and Hubspot."
        ]
      },
      {
        "heading": "A/B Testing",
        "bullets": [
          "Run A/B tests to identify the best-performing page variants.",
          "Optimize campaigns based on performance data."
        ]
      },
      {
        "heading": "Analytics and Tracking",
        "bullets": [
          "Monitor page performance with in-depth analytics.",
          "Gain insights into visitor behavior and conversion rates."
        ]
      },
      {
        "heading": "Agency Features",
        "bullets": [
          "Manage multiple client projects from a single dashboard.",
          "Provide detailed performance reports for clients."
        ]
      }
    ],
    "technologies": [
      "Javascript",
      "Typescript",
      "React Js",
      "Node Js",
      "Express Js",
      "Postgress",
      "Strapi",
      "Swagger",
      "Kubernetes",
      "Jest test",
      "Material UI",
      "CI/CD"
    ],
    "images": [
      {
        "src": "/img/neemiya/img1.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/neemiya/img2.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/neemiya/img3.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/neemiya/img4.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/neemiya/img5.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/neemiya/img6.png",
        "alt": "Description of image 3"
      }
    ],
    "link": "https://neemiya.com/"
  },
  {
    "id": 9,
    "title": "ASME : Grow Your Bussiness Advertise With Asme",
    "logo": "/img/asme/logo.png",
    "description": "The Association of Small & Medium Enterprises (ASME) is a non-profit organization in Singapore that supports the growth and development of SMEs. It provides resources, networking opportunities, training, and advocacy to help businesses thrive in the competitive market. ASME aims to promote entrepreneurship and strengthen the SME community through various initiatives and programs.",
    "companyName": "Freelance",
    "companySite": "https://www.asme.org.sg/",
    "workLogo": "/img/capauth/freelance.png",
    "role": "Project Manager & Senior Software Engineer",
    "data": [
      {
        "heading": "Business Support",
        "bullets": [
          "Provides resources and support for SMEs.",
          "Offers business advisory and consultancy services."
        ]
      },
      {
        "heading": "Networking Opportunities",
        "bullets": [
          "Hosts events for business networking and partnerships.",
          "Connects SMEs with industry leaders and professionals."
        ]
      },
      {
        "heading": "Training and Development",
        "bullets": [
          "Conducts workshops and seminars for skills development.",
          "Offers leadership and management training programs."
        ]
      },
      {
        "heading": "Advocacy and Representation",
        "bullets": [
          "Represents the interests of SMEs in policy discussions.",
          "Works with the government to create a conducive business environment."
        ]
      }
    ],
    "technologies": [
      "Javascript",
      "Typescript",
      "Kubernetes",
      "React Js",
      "Next Js",
      "Postgress",
      "Node Js",
      "Express Js",
      "Material UI",
      "Stripe CRM"
    ],
    "images": [
      {
        "src": "/img/asme/img0.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/asme/img1.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/asme/img2.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/asme/img3.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/asme/img4.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/asme/img5.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/asme/img6.png",
        "alt": "Description of image 3"
      }
    ],
    "link": "https://www.asme.org.sg/"
  },
  {
    "id": 10,
    "title": "GLUU : GAuthorize in Real time",
    "logo": "/img/gluu/logo.png",
    "description": "Gluu is an open-source Identity and Access Management (IAM) platform offering solutions for secure authentication, authorization, and identity management. It supports OAuth2, OpenID Connect, and SAML protocols, making it ideal for single sign-on (SSO) implementations. Gluu's flexibility allows for deployment in on-premises, cloud, or hybrid environments, and it offers advanced capabilities like adaptive authentication, real-time policy enforcement, and centralized identity orchestration.",
    "companyName": "Freelance",
    "companySite": "https://gluu.org/",
    "workLogo": "/img/capauth/freelance.png",
    "role": "Software Engineer",
    "data": [
      {
        "heading": "Protocol Support",
        "bullets": [
          "Supports OAuth2, OpenID Connect, and SAML for secure authentication and authorization.",
          "Provides Single Sign-On (SSO) capability across multiple applications."
        ]
      },
      {
        "heading": "Scalability",
        "bullets": [
          "Handles large-scale enterprise traffic with optimized performance.",
          "Deployable in cloud, on-premises, or hybrid environments for flexibility."
        ]
      },
      {
        "heading": "Security",
        "bullets": [
          "Enables FIDO2 and passwordless authentication for enhanced security.",
          "Supports multi-factor authentication (MFA) with adaptive policies."
        ]
      },
      {
        "heading": "Identity Orchestration",
        "bullets": [
          "Customizable identity flows for complex use cases.",
          "Real-time policy enforcement with centralized access management."
        ]
      },
      {
        "heading": "Integration",
        "bullets": [
          "Easily integrates with third-party identity providers (e.g., Azure AD, Okta).",
          "Supports diverse applications and custom plugins for extensibility."
        ]
      },
      {
        "heading": "User Experience",
        "bullets": [
          "Self-service portals for easy user and admin management.",
          "Automated workflows for user provisioning and de-provisioning."
        ]
      }
    ],
    "technologies": [
      "React",
      "JavaScript",
      "Java",
      "Python",
      "Node.js",
      "OpenID Connect",
      "SAML",
      "OAuth 2.0",
      "FIDO2/WebAuthn",
      "Kubernetes",
      "Docker",
      "AWS",
      "Google Cloud",
      "Azure",
      "LDAP",
      "OpenDJ",
      "OpenLDAP",
      "MySQL",
      "PostgreSQL",
      "Multi-Factor Authentication",
      "Cryptographic Challenges",
      "Passwordless Authentication",
      "Push Notifications"
    ],
    "images": [
      {
        "src": "/img/gluu/img1.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gluu/img2.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gluu/img3.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gluu/img4.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gluu/img5.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gluu/img6.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gluu/img7.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gluu/img8.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/gluu/img9.png",
        "alt": "Description of image 3"
      }
    ],
    "link": "https://gluu.org/"
  },
  {
    "id": 11,
    "title": "SHC - Singapore Home Cooks",
    "logo": "/img/shc/SHC.jpg",
    "description": "this is an innovative social commerce platform specifically designed to capture and process orders during Facebook Live sessions. It utilizes a powerful tech stack, including React and Redux on the frontend for a highly interactive and responsive user interface, while the backend is powered by Node.js. The system relies on PostgreSQL as the primary database, managed through Sequelize ORM to ensure efficient data handling and integrity. With this architecture, ORDRSTARTR provides a seamless, real-time shopping experience, enabling businesses to boost engagement and streamline purchases directly from live interactions.",
    "companyName": "Freelance",
    "companySite": "https://neemiya.com/",
    "workLogo": "/img/capauth/freelance.png",
    "role": "Project Manager & Senior Software Engineer",
    "data": [
      {
        "heading": "Order Management",
        "bullets": [
          "Edit and update orders in real-time.",
          "Manage the order status and history."
        ]
      },
      {
        "heading": "Communication",
        "bullets": [
          "Send personalized messages to customers.",
          "Send notifications and alerts to customers."
        ]
      },
      {
        "heading": "Product Management",
        "bullets": [
          "Add, edit, or remove products from the catalog.",
          "Manage product inventory and availability."
        ]
      },
      {
        "heading": "Payment and Checkout",
        "bullets": [
          "Oversee and manage the payment processing.",
          "Handle refunds, payment confirmations, and checkout issues."
        ]
      },
      {
        "heading": "User Profile Management",
        "bullets": [
          "Manage customer profiles with loyalty points and history.",
          "Implement loyalty management and coupon distribution."
        ]
      },
      {
        "heading": "Promotions and Discounts",
        "bullets": [
          "Create and apply discount codes and special offers.",
          "Track promotional campaigns and their effectiveness."
        ]
      },
      {
        "heading": "Live Stream Shopping",
        "bullets": [
          "Browse and interact with products showcased during live sessions.",
          "View product details and ask questions in real-time."
        ]
      },
      {
        "heading": "Seamless Purchase Experience",
        "bullets": [
          "Purchase products directly from live streaming.",
          "Receive instant checkout links for quick transactions."
        ]
      },
      {
        "heading": "Order Placement and Tracking",
        "bullets": [
          "Place orders during the live session without leaving the stream.",
          "Track order status and receive updates on delivery."
        ]
      },
      {
        "heading": "Secure Checkout Process",
        "bullets": [
          "Complete the checkout using secure payment gateways.",
          "Apply discounts and coupon codes during checkout."
        ]
      }
    ],
    "technologies": [
      "Javascript",
      "Typescript",
      "React Js",
      "Node Js",
      "Express Js",
      "MongoDB",
      "Mongoose",
      "Swagger",
      "Docker",
      "Jest test",
      "Material UI",
      "Strapi Payment",
      "Stripe CRM"
    ],
    "images": [
      {
        "src": "/img/shc/SH1.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/shc/SH2.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/shc/SH3.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/shc/SH4.png",
        "alt": "Description of image 3"
      },
      {
        "src": "/img/shc/SH5.png",
        "alt": "Description of image 3"
      }
    ],
    "link": "https://neemiya.com/"
  }
]
